app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "created_at") VALUES('2009-02-14 17:00:34', 'do comments work?/', 1, '2009-02-14 17:00:34')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])