app/controllers/posts_controller.rb

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-02-14 16:25:46', 'Hi', 'Hello', '2009-02-14 16:25:46')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Hellohi', "updated_at" = '2009-02-14 16:32:49' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])